Repository: Zildj1an/pmctrack
Catalog: src/gui/locale/*/LC_MESSAGES/pmctrackgui.po
Languages: es

source: No connection with ADB server.
es: No hay conexión con el servidor ADB.

source: The SSH key provided is invalid.
es: La clave SSH proporcionada es inválida.

source: The username or password are incorrect.
es: El nombre de usuario o la contraseña son incorrectos.

source: Connection timed out.
es: Límite de tiempo de conexión alcanzado.

source: Remote machine not found.
es: Máquina remota no encontrada.

source: Generated by PMCTrack-GUI on {0}
es: Generado por PMCTrack-GUI en {0}

source: Command launched on '{0}':
es: Comando lanzado en '{0}':

source: Version
es: Versión

source: PMCTrack-GUI is part of the PMCTrack performance monitoring tool. It is licensed under the GNU GENERAL PUBLIC LICENSE Version 2. More information in the official website.
es: PMCTrack-GUI forma parte de la herramienta de monitorización PMCTrack. Está licenciada bajo la licencia GNU GENERAL PUBLIC LICENSE Versión 2. Más información en la página web oficial.

source: Close
es: Cerrar

source: About
es: Acerca de

source: Path to pmctrack command
es: Ruta del comando pmctrack

source: Pmctrack command
es: Comando pmctrack

source: Time between samples (in milliseconds)
es: Tiempo entre muestras (en milisegundos)

source: Samples buffer size (in bytes, 0 for unspecified)
es: Tamaño del buffer de muestras (en bytes, 0 para no especificar)

source: Samples configuration
es: Configuración de las muestras

source: Select counter mode
es: Selecciona el modo de contador

source: What counter mode you want to use?
es: ¿Qué modo de contador quieres usar?

source: Per-thread mode
es: Modo de contador por hilo

source: System-wide mode
es: Modo system-wide

source: What monitoring logs want to save?
es: ¿Qué logs deseas guardar?

source: Counters samples log
es: Log de muestras de contadores

source: Metrics samples log
es: Log de muestras de métricas

source: Path to save monitoring logs
es: Ruta donde guardar los logs

source: Select directory where to save the output file
es: Seleccionar directorio donde guardar el fichero

source: Save monitoring logs into files
es: Guardar logs de monitorización en ficheros

source: Save advanced settings
es: Guardar ajustes avanzados

source: Advanced settings
es: Ajustes avanzados

source: Select event
es: Seleccionar evento

source: Select subevents
es: Seleccionar subeventos

source: Advanced options
es: Opciones avanzadas

source: Assign event to counter
es: Asignar evento a contador

source: No subevents for the selected event.
es: No hay subeventos para este evento.

source: Open configuration
es: Abrir configuración

source: Save configuration
es: Guardar configuración

source: Save configuration as...
es: Guardar configuración como...

source: Quit
es: Cerrar

source: Go to machine configuration
es: Ir a la configuración de la máquina

source: Go to counters and metrics configuration
es: Ir a la configuración de contadores y métricas

source: Go to final configuration
es: Ir a la configuración final

source: Start/Stop monitoring
es: Iniciar/Parar monitorización

source: File
es: Archivo

source: Actions
es: Acciones

source: Help
es: Ayuda

source: It found a default configuration file. Do you want to load it?
es: Se ha encontrado un archivo de configuración por defecto. ¿Deseas cargarlo?

source: Load default config
es: Cargar configuración por defecto

source: 'sshpass' package is required to authenticate by password.
es: El paquete 'sshpass' es necesario para autenticar por contraseña.

source: Information
es: Información

source: 'android-tools-adb' package is required to perform remote monitoring using ADB.
es: El paquete 'android-tools-adb' es necesario para la monitorización remota por ADB.

source: Unable to access to '{0}'
es: Imposible acceder a '{0}'

source: PMCTrack configuration file not found. Make sure you have loaded the pmctrack module on the machine to be monitored.
es: Archivo de configuración de PMCTrack no encontrado. Asegúrate que la máquina a monitorizar tiene el módulo de PMCTrack cargado.

source: By changing the machine to monitor settings previously made will be deleted. Are you sure you wanna do this?.
es: Al cambiar la máquina a monitorizar, la configuración realizada previamente será eliminada. ¿Estás seguro de que quieres hacer esto?

source: Changes detected in the machine config
es: Detectados cambios en la configuración de la máquina

source: Do you want to save the current monitoring configuration as default configuration?
es: ¿Deseas guardar la configuración de monitorización actual como la configuración por defecto?

source: Save config
es: Guardar configuración

source: Save PMCTrack-GUI config file as
es: Guardar archivo de configuración de PMCTrack-GUI como...

source: All files
es: Todos los archivos

source: PMCTrack-GUI config file
es: Archivo de configuración de PMCTrack-GUI

source: Open PMCTrack-GUI config file
es: Abrir archivo de configuración de PMCTrack-GUI

source: Monitoring setup is incomplete
es: La configuración de monitorización está incompleta

source: To start monitoring is necessary to fill the fields in the counters and metrics configuration panel and the final panel.
es: Para poder iniciar la monitorización es necesario completar los campos del panel de configuración de contadores y métricas y del panel de configuración final.

source: Machine selection
es: Selección de máquina a monitorizar

source: Counters & metrics configuration
es: Configuración de los contadores y métricas

source: Final monitoring configuration
es: Configuración final de monitorización

source: Show virtual counters
es: Mostrar contadores virtuales

source: Add experiment
es: Añadir exp.

source: Remove experiment
es: Eliminar exp.

source: Virtual counters available
es: Contadores virtuales disponibles

source: Back
es: Volver

source: Next
es: Siguiente

source: Experiment
es: Experimento

source: All experiments must be at least one metric.
es: Todos los experimentos deben tener al menos una métrica configurada.

source: Hide virtual counters
es: Ocultar contadores virtuales

source: This is the only existing experiment and at least there must be one.
es: Éste es el único experimento existente, no puedes eliminarlo.

source: You are about to delete the experiment {0} and all its associated configuration. Are you sure you wanna do this?.
es: Estás a punto de eliminar el experimento {0} y toda su configuración asociada. ¿Estás seguro de que quieres hacer esto?.

source: Advertisement
es: Advertencia

source: Change event
es: Cambiar evento

source: Change event to
es: Cambiar evento a

source: Fixed-function counter
es: Contador de evento fijo

source: Fixed
es: Fijo

source: General purpose counter
es: Contador de propósito general

source: No event assigned
es: Ningún evento asignado

source: Assign event
es: Asignar evento

source: Hardware counters configuration
es: Configuración de los contadores hardware

source: Metrics configuration
es: Configuración de las métricas

source: There is no any metric for this experiment yet. Use the form below to add one.
es: Todavía no hay métricas establecidas para este experimento. Usa el formulario de abajo para añadir una.

source: Name
es: Nombre

source: Formula
es: Fórmula

source: Add metric
es: Añadir métrica

source: Assign event to
es: Asignar evento a

source: In order to enable a counter, one event has to be assigned first.
es: No puedes habilitar un contador que no tiene ningún evento asignado.

source: The formula of a metric must consist of variables (some of the activated hardware counters such pmc0, pmc1, etc; or virtual counters such virt0), constants and arithmetic operations (multiplication *, division /, plus + and minus -). These are some valid examples:
es: La fórmula de una métrica debe estar compuesta por variables (alguno de los contadores activados como pmc0, pmc1, etc; o contadores virtuales como virt0), constantes y operaciones aritméticas (multiplicación *, división /, suma + y resta -). Estos son algunos ejemplos válidos:

source: Help - Format formula
es: Ayuda - Formato de la fórmula

source: Metric
es: Métrica

source: Remove metric
es: Eliminar métrica

source: No binding
es: Sin especificar

source: Is the app to monitor running?
es: ¿La app a monitorizar está en ejecución?

source: Yes
es: Sí

source: Path to application to monitor
es: Ruta de la aplicación a monitorizar

source: Select application
es: Seleccionar aplicación

source: Application's arguments
es: Argumentos de la aplicación

source: Select CPU to bind or type mask
es: Selecciona o introduce máscara CPU

source: Application's PID
es: PID de la aplicación

source: Select multi-application file
es: Selecciona archivo multi-aplicación

source: Graph style mode
es: Estilo de la gráfica

source: Default
es: Por defecto

source: Expert mode
es: Modo experto

source: Start monitoring
es: Iniciar monitorización

source: Single-app mode
es: Modo única aplicación

source: Multi-app mode
es: Modo múltiples aplicaciones

source: on remote machine
es: en la máquina remota

source: Some of the applications specified in the multi-application file does not exist{0}. Check the multi-application file.
es: Algunas de las aplicaciones especificadas en el archivo multi-app no existen{0}. Comprueba el archivo multi-app.

source: Pmctrack command path is invalid.
es: La ruta del comando pmctrack es inválida.

source: Can not find the application to monitoring.
es: No se puede encontrar la aplicación a monitorizar.

source: No application running with the PID indicated.
es: No hay ninguna aplicación en ejecución con el PID indicado.

source: You must select a valid multi-application file.
es: Debes seleccionar un archivo multi-aplicación válido.

source: Cancel monitoring
es: Cancelar monitorización

source: You are about to cancel monitoring, killing the current application and closing windows monitoring. Are you sure you wanna do this?.
es: Estás a punto de cancelar la monitorización, matando la aplicación actual y cerrando las ventanas de monitorización. ¿Estás seguro de que quieres hacer esto?.

source: You are about to cancel monitoring, closing windows monitoring but without killing the monitored application. Are you sure you wanna do this?.
es: Estás a punto de cancelar la monitorización, cerrando las ventanas de monitorización pero sin matar la aplicación monitorizada. ¿Estás seguro de que quieres hacer esto?.

source: List of graph style modes
es: Lista de modos de estilo de gráfica

source: Preview
es: Vista previa

source: Background color
es: Color de fondo

source: Grid color
es: Color del grid

source: Line color
es: Color de la línea

source: Line style
es: Estilo de la línea

source: Dashdot
es: Combinado

source: Dashed
es: Interlineado

source: Dotted
es: Micropuntos

source: Solid
es: Sólido

source: Line width
es: Ancho de la línea

source: Customize
es: Personalizar

source: Apply graph style
es: Aplicar estilo de gráfica

source: Graph style configuration
es: Configuración de estilo de gráfica

source: Customized
es: Personalizado

source: {0} mode
es: Modo {0}

source: Remote (using ADB)
es: Remota (usando ADB)

source: Remote (using SSH)
es: Remota (usando SSH)

source: Select machine to monitor
es: Seleccionar máquina a monitorizar

source: Address
es: Dirección

source: Port
es: Puerto

source: Username
es: Usuario

source: How do you want to authenticate?
es: ¿Cómo quieres realizar la autenticación?

source: Using password
es: Por contraseña

source: Using SSH key
es: Por clave SSH

source: Password
es: Contraseña

source: Select your SSH key
es: Selecciona la clave pública

source: SSH Key
es: Clave SSH

source: Remote machine SSH parameters
es: Parámetros SSH de la máquina remota

source: Remote ADB-server parameters
es: Parámetros del servidor ADB

source: Show graph
es: Mostrar gráfica

source: Open up graph in a new window
es: Abrir gráfica en una nueva ventana

source: Select graph to show
es: Seleccionar gráfica a mostrar

source: Waiting monitoring data...
es: Esperando a recibir datos de monitorización...

source: Show complete graph
es: Mostrar gráfica acumulada

source: Take graph screenshot
es: Realizar captura de la gráfica

source: Hide controls
es: Ocultar controles

source: Show controls
es: Mostrar controles

source: Stop application
es: Parar aplicación

source: Options
es: Opciones

source: Monitoring application '{0}'
es: Monitorizando aplicación '{0}'

source: Showing graph with {0} {1}, experiment {2} and metric '{3}'
es: Mostrando gráfica con {0} {1}, experimento {2} y métrica '{3}'

source: (waiting)
es: (esperando)

source: Samples
es: Muestras

source: PMCTrack error
es: Error en PMCTrack

source: (finished)
es: (finalizado)

source: Close monitoring windows
es: Cerrar ventanas de monit.

source: The application '{0}' is done.
es: La aplicación '{0}' ha terminado.

source: (stopped)
es: (parado)

source: Resume application
es: Reanudar aplicación

source: Show partial graph
es: Mostrar gráfica parcial

source: Save graph screenshot as...
es: Guardar captura de la gráfica como...

source: List of applications to monitor
es: Lista de aplicaciones a monitorizar

source: {0}/{1} applications completed.
es: {0}/{1} aplicaciones completadas.

source: Monitoring applications
es: Monitorizando aplicaciones

source: (running)
es: (ejecutándose)

source: All applications are done.
es: Todas las aplicaciones han terminado.

source: '{0}' password on '{1}' machine:
es: Contraseña de '{0}' en la máquina '{1}':

source: Load configuration
es: Cargar configuración

source: Password required
es: Contraseña requerida
